class script(object):
    START_TXT = """<b><u>ɪ ᴀᴍ ᴍɪᴋᴀsᴀ, ʏᴏᴜʀ ᴜʟᴛɪᴍᴀᴛᴇ ʟɪʙʀᴀʀʏ ᴀssɪsᴛᴀɴᴛ</u></b>

<b>ʜᴇʏ {}, {}</b>

<b>🤖 ɪ ᴀᴍ <a href=https://t.me/{}>{}</a>, ᴛʜᴇ ᴍᴏsᴛ ᴘᴏᴡᴇʀғᴜʟ ʙᴏᴏᴋ & ᴍᴀɴɢᴀ ᴘʀᴏᴠɪᴅᴇʀ ʙᴏᴛ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ ғᴇᴀᴛᴜʀᴇs.</b>
"""

    GSTART_TXT = """<b>ɪ ᴀᴍ ᴍɪᴋᴀsᴀ, ʏᴏᴜʀ ᴜʟᴛɪᴍᴀᴛᴇ ʟɪʙʀᴀʀʏ ᴀssɪsᴛᴀɴᴛ</b>

<b>ʜᴇʏ {},</b>

<b>🤖 ɪ ᴀᴍ <a href=https://t.me/{}>{}</a>, ᴛʜᴇ ᴍᴏsᴛ ᴘᴏᴡᴇʀғᴜʟ ᴄᴏɴᴛᴇɴᴛ ᴘʀᴏᴠɪᴅᴇʀ ʙᴏᴛ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ ғᴇᴀᴛᴜʀᴇs.</b>"""

    HELP_TXT = """<b>
✨ ʜᴏᴡ ᴛᴏ ʀᴇǫᴜᴇsᴛ ʙᴏᴏᴋs & ᴍᴀɴɢᴀ ✨  

1️⃣ sᴇᴀʀᴄʜ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ ᴛɪᴛʟᴇ ᴏɴ ɢᴏᴏɢʟᴇ.  
2️⃣ sᴇɴᴅ ᴛʜᴇ ɴᴀᴍᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ.  
3️⃣ ᴜsᴇ ᴛʜɪs ғᴏʀᴍᴀᴛ:  

📌 ғᴏʀ ᴍᴀɴɢᴀ ᴠᴏʟᴜᴍᴇs:  
➤ ᴍᴀɴɢᴀ ɴᴀᴍᴇ + Vol 01 (ғᴏʀ ᴠᴏʟᴜᴍᴇ 1, ᴄʜᴀɴɢᴇ ғᴏʀ ᴏᴛʜᴇʀs)  

📌 ғᴏʀ sᴘᴇᴄɪғɪᴄ ғᴏʀᴍᴀᴛs:  
➤ ʙᴏᴏᴋ ɴᴀᴍᴇ + ᴘᴅғ ᴏʀ ᴇᴘᴜʙ  

📌 ғᴏʀ ɪɴᴛᴇʀɴᴀᴛɪᴏɴᴀʟ ʙᴏᴏᴋs:  
➤ ᴛɪᴛʟᴇ + ʟᴀɴɢᴜᴀɢᴇ (ᴇx: ᴛɪᴛʟᴇ ʀᴜssɪᴀɴ)  

🚀 ғᴏʟʟᴏᴡ ᴛʜᴇsᴇ sᴛᴇᴘs!
</b>"""

    ABOUT_TXT = """<b>╭────[ ᴍʏ ᴅᴇᴛᴀɪʟs ]────⍟
├⍟ Mʏ Nᴀᴍᴇ : <a href=https://t.me/{}>{}</a>
├⍟ Dᴇᴠᴇʟᴏᴘᴇʀ : <a href={}>ᴏᴡɴᴇʀ</a> 
├⍟ Cᴏɴᴛᴇɴᴛ : ʙᴏᴏᴋs, ᴍᴀɴɢᴀ, ᴍᴀɴʜᴡᴀ
├⍟ Lɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ
├⍟ Dᴀᴛᴀʙᴀsᴇ : ᴍᴏɴɢᴏ ᴅʙ
├⍟ Bᴜɪʟᴅ Sᴛᴀᴛᴜs : ᴠ1.4 [ ʟɪʙʀᴀʀʏ ᴇᴅɪᴛɪᴏɴ ]
╰───────────────⍟</b>"""

    I_CUDNT = """<b>sᴏʀʀʏ, ɴᴏ ʙᴏᴏᴋs ᴡᴇʀᴇ ғᴏᴜɴᴅ ғᴏʀ ʏᴏᴜʀ ʀᴇǫᴜᴇsᴛ {} 😕

ᴄʜᴇᴄᴋ ʏᴏᴜʀ sᴘᴇʟʟɪɴɢ ɪɴ ɢᴏᴏɢʟᴇ ᴀɴᴅ ᴛʀʏ ᴀɢᴀɪɴ 😃 
ɪғ sᴛɪʟʟ ɴᴏᴛ ғᴏᴜɴᴅ, ᴘʟᴇᴀsᴇ ʀᴇǫᴜᴇsᴛ ᴜs ᴀɴᴅ ᴡᴇ ᴡɪʟʟ ᴜᴘᴅᴀᴛᴇ ᴏᴜʀ ʟɪʙʀᴀʀʏ!

📝 ʙᴏᴏᴋ ʀᴇǫᴜᴇsᴛ ғᴏʀᴍᴀᴛ 👇
⚜️ ᴇxᴀᴍᴘʟᴇ : Atomic Habits PDF

📝 ᴍᴀɴɢᴀ ʀᴇǫᴜᴇsᴛ ғᴏʀᴍᴀᴛ 👇
⚜️ ᴇxᴀᴍᴘʟᴇ : Lookism Vol 01 or Lookism Vol 05</b>"""

    DEL_MSG = """⚠️ ᴛʜɪs ᴅᴏᴄᴜᴍᴇɴᴛ ᴡɪʟʟ ʙᴇ ᴅᴇʟᴇᴛᴇᴅ ɪɴ <b><u><code>{}</code></u></b> ᴛᴏ sᴀᴠᴇ sᴘᴀᴄᴇ.

<blockquote expandable><b><i>ᴘʟᴇᴀsᴇ ғᴏʀᴡᴀʀᴅ ᴛʜɪs ʙᴏᴏᴋ ᴛᴏ ʏᴏᴜʀ 'sᴀᴠᴇᴅ ᴍᴇssᴀɢᴇs' ᴏʀ ᴀ ᴘʀɪᴠᴀᴛᴇ ᴄʜᴀɴɴᴇʟ!</i></b></blockquote>"""

    CAPTION = """<b><a href="https://t.me/updates_op">{file_name}</a></b>\n\n<b>📚 Mikasa Library : <a href="https://t.me/scout_regimant">[ Scout Regiment ]</a></b>"""

    STATUS_TXT = """<b>╭────[ 📚 ʟɪʙʀᴀʀʏ sᴛᴀᴛs 📚 ]────⍟</b>
│
├⋟ ʀᴇᴀᴅᴇʀs ⋟ <code>{}</code>
├⋟ ɢʀᴏᴜᴘs ⋟ <code>{}</code>
├⋟ ᴘʀᴇᴍɪᴜᴍ ᴜsᴇʀs ⋟ <code>{}</code>
├⋟ ᴛᴏᴛᴀʟ ʙᴏᴏᴋs ⋟ <code>{}</code>
├⋟ sᴛᴏʀᴀɢᴇ ᴜsᴇᴅ ⋟ <code>{}</code>
│
<b>╰─────────────────────⍟</b>"""

    PREMIUM_TEXT = """<blockquote>🎖️ <b>ʟɪʙʀᴀʀʏ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs</b></blockquote>

◉ 07 ᴅᴀʏs - 10 ₹  / 10 sᴛᴀʀ
◉ 30 ᴅᴀʏs - 29 ₹  / 29 sᴛᴀʀ
◉ 60 ᴅᴀʏs - 75 ₹  / 75 sᴛᴀʀ

•─────•─────────•─────•
🚀 <b>ᴘʀᴇᴍɪᴜᴍ ʙᴇɴᴇғɪᴛs:</b>
○ ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪғʏ ʟɪɴᴋs
○ ᴅɪʀᴇᴄᴛ ᴘᴅғ/ᴇᴘᴜʙ ғɪʟᴇs
○ sᴜᴘᴇʀ-ғᴀsᴛ ᴅᴏᴡɴʟᴏᴀᴅs
○ ᴀᴅ-ғʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ"""
